main.floors.MA1 =
{
    "floorId": "MA1",
    "title": "地下 1 层",
    "name": "地下 1 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,6": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {
        "2,7": [
            "\t[勇士,hero]（是妖精的福袋，跟杰克留下的铁门钥匙一样，这是她故意留下来指引我前进的线索吗？）",
            "\t[勇士,hero]（这么说来，妖精多半也遭遇不测了。）",
            "\t[勇士,hero]（你们两个，一定要平安无事啊。）"
        ]
    },
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
        [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2],
        [2, 21, 21, 2, 1261, 2, 22, 1262, 2, 21, 2, 1276, 2],
        [2, 1276, 1276, 82, 1261, 81, 0, 0, 81, 22, 82, 256, 2],
        [2, 2, 254, 2, 618, 2, 1617, 2, 2, 254, 2, 1515, 2],
        [2, 1263, 1290, 618, 0, 81, 0, 0, 2, 0, 2, 2, 2],
        [2, 2, 81, 2, 2, 2, 2, 256, 82, 1594, 1269, 1269, 2],
        [2, 87, 0, 618, 1262, 1594, 0, 0, 2, 256, 2, 2, 2],
        [2, 1263, 0, 2, 256, 2, 2, 81, 2, 1263, 2, 1262, 2],
        [2, 2, 2, 2, 618, 2, 1269, 1263, 618, 0, 81, 22, 2],
        [2, 1269, 345, 2, 81, 2, 2, 279, 2, 219, 2, 1262, 2],
        [2, 2, 1276, 772, 22, 1261, 82, 21, 2, 618, 2, 2, 2],
        [2, 1276, 345, 2, 1263, 1262, 2, 1262, 256, 0, 0, 88, 2],
        [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]
    ],
    "underGround": true,
    "bgmap": [

    ],
    "fgmap": [

    ]
}