main.floors.MA9=
{
    "floorId": "MA9",
    "title": "地下 9 层",
    "name": "地下 9 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2,
    "defaultGround": "ground",
    "firstArrive": [
        "\t[勇士,hero]\b[down,null]？！",
        {
            "type": "playSound",
            "name": "MaleScream.mp3",
            "sync": true
        },
        "\t[勇士,hero]\b[down,null]这个惨叫声......是杰克吗？",
        {
            "type": "playSound",
            "name": "GirlLaugh.ogg",
            "sync": true
        },
        "\t[小女孩的声音]\b[down,null]嘻嘻，你以为我不知道你在打什么小算盘吗？",
        "\t[小女孩的声音]\b[down,null]在这座魔塔里，我虽然称不上全知全能，但窥探你这个低等意识体的精神世界还不是轻轻松松？",
        "\t[小女孩的声音]\b[down,null]利用他帮你找回镐头，好让你自己破开零层的墙壁逃出魔塔，哼哼，想的倒是挺美嘛。",
        {
            "type": "playSound",
            "name": "MaleScream.mp3",
            "sync": true
        },
        "\t[小女孩的声音]\b[down,null]不错的眼神，嘻嘻......放心吧，为了让这个计划继续进行下去，我是不会杀你的。",
        {
            "type": "playSound",
            "name": "GirlLaugh.ogg",
            "sync": true
        },
        "\t[小女孩的声音]\b[down,null]但是啊，让你生不如死的点子，我脑子里可是存着一大堆呢。",
        {
            "type": "playSound",
            "name": "MaleScream.mp3",
            "sync": true
        },
        "\t[勇士,hero]\b[down,null]杰克现在的处境一定很不妙。必须得快点攻进那里才行......"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "2,3": [
            "\t[勇士,hero]（昏暗的小房间内，浑身是血的杰克抬头望着天花板，似乎并没有察觉到我的到来，小小的妖精则是缩在角落里轻轻抽泣着。）",
            "\t[勇士,hero]呼......妖精，杰克，幸亏你们还活着。",
            "\t[妖精,fairy]你这个磨蹭鬼，为什么等了这么久才来救我们啊！好黑......好痛，你知道我有多害怕吗？",
            "\t[勇士,hero]抱歉......这一路上的怪物都比较难缠。",
            "\t[勇士,hero]（我用眼角观察了一下二人的伤势，妖精背后那对小翅膀上布满裂纹，根部的连接处则是呈现出一派血肉模糊的景象。）",
            "\t[勇士,hero]（杰克这边的伤势则是更加严重，他整支左臂的皮肤都被扒下来了，肌肉纹理与血管组织清晰可辨，浑身上下都遍布着大小伤口，几乎看不出人样来。）",
            "\t[勇士,hero]（恶意，行凶者纯粹的恶意让我陷入出离的愤怒。）",
            "\t[勇士,hero]是谁？究竟是谁！对你们做出如此过分的事情......可恶......都怪我，都是因为我擅自昏倒，才让那家伙找到了行凶时机。",
            "\t[妖精,fairy]......（抹掉眼泪）那人是趁你在三区昏倒的时候，从背后击昏我的，啧......我没看到她的脸，真是令人火大！",
            "\t[杰克,thief]......没错，我也是被那家伙从背后袭击，再一路拖到这个地下室里来的。",
            "\t[勇士,hero]（我环顾了一下四周，小小的暗房里溅满了血迹，触目惊心，房间的构造十分简陋，甚至没有窗户，出入口只有一扇门。）",
            "\t[勇士,hero]对了，刚才我在房间外面有听见女孩的笑声，可是这个密室里却只有你们两个受害者而已，这是怎么一回事？",
            "\t[杰克,thief]行凶者是个女孩，体型跟妖精差不多大，可是这么小的女孩，为什么会有徒手把我从16楼拖到地下室的力气与体能？",
            "\t[勇士,hero]在魔塔里，什么怪事都有可能发生。",
            "\t[勇士,hero]行凶者是一个体型跟妖精差不多大的小女孩，拥有足以制服一个成年人类男性的怪力。",
            "\t[勇士,hero]并且手段十分阴险毒辣......此外，她非常了解我。",
            "\t[妖精,fairy]诶？为什么你会认定她非常了解你呢？",
            "\t[勇士,hero]她算准了我会在战胜区域头目后昏倒一段时间，说不定那家伙从一开始就一直跟在我跟妖精的背后......",
            "\t[妖精,fairy]哇啊啊！别说这么可怕的话啊！吓死人了！",
            "\t[勇士,hero]现在我最想弄清楚的问题是，在听到女孩笑声直到我踏进密室的这段时间里，我没看到任何人出入。",
            "\t[勇士,hero]可是现在，密室里只有你们两个人而已，这个行凶者难不成还会瞬移？",
            "\t[妖精,fairy]哦，这个啊，我记得那家伙在对我们施完虐以后，就从房间北面的这个小木窗里逃跑了。",
            {
                "type": "move",
                "loc": [
                    2,
                    1
                ],
                "time": 500,
                "keep": true,
                "steps": [
                    "right:1"
                ]
            },
            {
                "type": "moveHero",
                "time": 500,
                "steps": [
                    "up:3"
                ]
            },
            {
                "type": "animate",
                "name": "hand",
                "loc": [
                    2,
                    0
                ]
            },
            "\t[勇士,hero]（我敲打了一下木窗......有回音，这后面应该不是一堵墙。）",
            {
                "type": "animate",
                "name": "sword",
                "loc": [
                    2,
                    0
                ]
            },
            "\t[勇士,hero]（我尝试用剑砍，用肘部敲击，甚至用身体去撞这个看上去不是很坚固的木窗，但是无论我怎样做，木窗都纹丝不动。）",
            {
                "type": "changePos",
                "loc": [
                    2,
                    1
                ],
                "direction": "right"
            },
            "\t[勇士,hero]这个木窗似乎跟整个空间粘合在了一起，完全无法用外力破坏。",
            "\t[勇士,hero]这个特性让我想起来魔塔里随处可见的黄蓝门，这扇木窗，据我猜测，应该是需要特定钥匙才能打开的魔法器。",
            "\t[妖精,fairy]你接下来打算怎么办？",
            "\t[勇士,hero]当然是找钥匙打开这扇木窗，找到她，然后好好清算一下这笔账。",
            "\t[妖精,fairy]虽然我知道你是在为我跟杰克考虑，但是......别被仇恨冲昏头脑啊。",
            "\t[勇士,hero]我可不仅仅是为了替你们两个报仇。",
            "\t[勇士,hero]她对你跟杰克出手的原因，无非就是为了让我无法继续向顶层前进，既然她明我暗，与其坐以待毙，我还不如主动出击。",
            "\t[杰克,thief]......慢着，你怎么知道她的目的是阻止你前进？",
            "\t[勇士,hero]她囚禁妖精这个向导，是为了断绝我的信息来源，她废掉了你另一支手臂，则是让我无法借助你的力量挖通前往下一个区域的通道。",
            "\t[勇士,hero]我甚至怀疑三区域宝库里的镐头也是被她给拿走的......这家伙，心机可真深，想来并不是什么容易对付的敌人。",
            "\t[妖精,fairy]可是......就凭你一个人的力量，能跟这样的敌人对抗吗？",
            "\t[妖精,fairy]让我陪你一起去吧......唔！好痛！",
            "\t[勇士,hero]别逞强，你现在伤势重得连起身都难，就不要来陪我赶这趟浑水了。",
            "\t[勇士,hero]对了，你不是会治愈魔法吗？我看你这些伤都在治愈魔法能够使用的范围内啊。",
            "\t[妖精,fairy]使用魔法需要消耗巨额魔力，但在这一路的冒险中我的魔力槽早就见底了，抱歉，我好像不能陪你同行了......",
            "\t[杰克,thief]我曾经挖密道来过地下层，我知道地下层二区有颗被众多魔物看守的精魂宝石，这种宝石拥有恢复使用者全额魔力的神奇力量。",
            "\t[妖精,fairy]......嗯，没错，是有这种东西来着，我怎么忘记了呢？",
            "\t[勇士,hero]好，我这就前往地下二区找那颗宝石，只能先委屈你们留在这里等我了。",
            "\t[杰克,thief]对了，哥们儿，拿上这个。",
            {
                "type": "setValue",
                "name": "item:I1515",
                "operator": "+=",
                "value": "1"
            },
            "从杰克手中接过了 [商店抵用券]*1",
            "\t[妖精,fairy]那我也来给你提供一些规则范围内允许的帮助吧。",
            {
                "type": "setValue",
                "name": "item:I1546",
                "operator": "+=",
                "value": "1"
            },
            "从妖精手中接过了 [便携式恢复药水]*1",
            "\t[勇士,hero]多谢，就算只是为了不辜负你们对我的一番好意，我也一定会把这个万恶的行凶者给揪出来的。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "2,4": [
            {
                "type": "setBgFgBlock",
                "name": "fg",
                "number": "X10054",
                "loc": [
                    [
                        2,
                        0
                    ]
                ]
            },
            {
                "type": "hide",
                "loc": [
                    [
                        1,
                        1
                    ]
                ],
                "remove": true
            },
            {
                "type": "setBlock",
                "number": "fairy",
                "loc": [
                    [
                        2,
                        1
                    ]
                ]
            },
            {
                "type": "hide",
                "loc": [
                    [
                        3,
                        1
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        4,
                        1
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        1,
                        2
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        2,
                        2
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        3,
                        2
                    ]
                ],
                "remove": true
            },
            {
                "type": "setBlock",
                "number": "thief",
                "loc": [
                    [
                        4,
                        2
                    ]
                ]
            },
            {
                "type": "hide",
                "loc": [
                    [
                        1,
                        3
                    ]
                ],
                "remove": true
            },
            {
                "type": "setBlock",
                "number": "ground",
                "loc": [
                    [
                        2,
                        3
                    ]
                ]
            },
            {
                "type": "hide",
                "loc": [
                    [
                        3,
                        3
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        4,
                        3
                    ]
                ],
                "remove": true
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10016,10017,10017,10017,10017,10018,  2,  2,  2,  2,  2,  2,  2],
    [10024,10025,10025,10025,10025,10026, 88,  2,1276,  2,1262,1262,  2],
    [10024,10025,10025,10025,10025,10026,  0, 82,  0,897,1269,1283,  2],
    [10024,10025,10025,10025,10025,10026,525,  2,772,  2,  2, 81,  2],
    [10032,10033, 82,10033,10033,10034,1269, 81,  0,  2,1283,1262,  2],
    [  2,1262,  0, 81, 22,  2,1264,  2,  0,219, 21,1262,  2],
    [  2,  2,897,  2,  2,  2,  2, 22,525,  2, 82,  2,  2],
    [  2,1269,  0, 81,1290,897,1269,  2,  0,  0,836,1269,  2],
    [  2,1276,  0,  2,1515,  2, 21,1264,  2, 81,  2,  2,  2],
    [  2,  2,836,  2,  2,  2, 82,  2,  2,219,  2,1263,  2],
    [  2, 21,897,1263, 82,  0,  0,  0,219,  0, 81,1262,  2],
    [  2,1276,  2,1269,  2,1290, 87,1264,  2,1269,  2,1263,  2],
    [  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2]
],
    "underGround": true,
    "bgmap": [

],
    "fgmap": [

]
}