main.floors.MA9=
{
    "floorId": "MA9",
    "title": "地下 9 层",
    "name": "地下 9 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2,
    "defaultGround": "ground",
    "firstArrive": [
        "\t[勇士,hero]\b[down,null]？！",
        {
            "type": "playSound",
            "name": "MaleScream.mp3",
            "sync": true
        },
        "\t[勇士,hero]\b[down,null]这个惨叫声......是杰克吗？",
        {
            "type": "playSound",
            "name": "GirlLaugh.ogg",
            "sync": true
        },
        "\t[小女孩的声音]\b[down,null]嘻嘻，你以为我不知道你在打什么小算盘吗？",
        "\t[小女孩的声音]\b[down,null]在这座魔塔里，我虽然称不上全知全能，但窥探你这个低等意识体的精神世界还不是轻轻松松？",
        "\t[小女孩的声音]\b[down,null]利用他帮你找回镐头，好让你自己破开零层的墙壁逃出魔塔，哼哼，想的倒是挺美嘛。",
        {
            "type": "playSound",
            "name": "MaleScream.mp3",
            "sync": true
        },
        "\t[小女孩的声音]\b[down,null]不错的眼神，嘻嘻......放心吧，为了让这个计划继续进行下去，我是不会杀你的。",
        {
            "type": "playSound",
            "name": "GirlLaugh.ogg",
            "sync": true
        },
        "\t[小女孩的声音]\b[down,null]但是啊，让你生不如死的点子，我脑子里可是存着一大堆呢。",
        {
            "type": "playSound",
            "name": "MaleScream.mp3",
            "sync": true
        },
        "\t[勇士,hero]\b[down,null]杰克现在的处境一定很不妙。必须得快点攻进那里才行......"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "2,3": {
            "trigger": null,
            "enable": true,
            "noPass": false,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                {
                    "type": "switch",
                    "condition": "flag:N9F",
                    "caseList": [
                        {
                            "case": "0",
                            "action": [
                                "\t[勇士,hero]（昏暗的小房间内，浑身是血的杰克抬头望着天花板，似乎并没有察觉到我的到来，小小的妖精则是缩在角落里轻轻抽泣着。）",
                                "\t[勇士,hero]呼......妖精，杰克，幸亏你们还活着。",
                                "\t[妖精,fairy]你这个磨蹭鬼，为什么等了这么久才来救我们啊！好黑......好痛，你知道我有多害怕吗？",
                                "\t[勇士,hero]抱歉......这一路上的怪物都比较难缠。",
                                "\t[勇士,hero]（我用眼角观察了一下二人的伤势，妖精背后那对小翅膀上布满裂纹，根部的连接处则是呈现出一派血肉模糊的景象。）",
                                "\t[勇士,hero]（杰克这边的伤势则是更加严重，他整支左臂的皮肤都被扒下来了，肌肉纹理与血管组织清晰可辨，浑身上下都遍布着大小伤口，几乎看不出人样来。）",
                                "\t[勇士,hero]（恶意，行凶者纯粹的恶意让我陷入出离的愤怒。）",
                                "\t[勇士,hero]是谁？究竟是谁！对你们做出如此过分的事情......可恶......都怪我，都是因为我擅自昏倒，才让那家伙找到了行凶时机。",
                                "\t[妖精,fairy]......（抹掉眼泪）那人是趁你在三区昏倒的时候，从背后击昏我的，啧......我没看到她的脸，真是令人火大！",
                                "\t[杰克,thief]......没错，我也是被那家伙从背后袭击，再一路拖到这个地下室里来的。",
                                "\t[勇士,hero]（我环顾了一下四周，小小的暗房里溅满了血迹，触目惊心，房间的构造十分简陋，甚至没有窗户，出入口只有一扇门。）",
                                "\t[勇士,hero]对了，刚才我在房间外面有听见女孩的笑声，可是这个密室里却只有你们两个受害者而已，这是怎么一回事？",
                                "\t[杰克,thief]行凶者是个女孩，体型跟妖精差不多大，可是这么小的女孩，为什么会有徒手把我从16楼拖到地下室的力气与体能？",
                                "\t[勇士,hero]在魔塔里，什么怪事都有可能发生。",
                                "\t[勇士,hero]行凶者是一个体型跟妖精差不多大的小女孩，拥有足以制服一个成年人类男性的怪力。",
                                "\t[勇士,hero]并且手段十分阴险毒辣......此外，她非常了解我。",
                                "\t[妖精,fairy]诶？为什么你会认定她非常了解你呢？",
                                "\t[勇士,hero]她算准了我会在战胜区域头目后昏倒一段时间，说不定那家伙从一开始就一直跟在我跟妖精的背后......",
                                "\t[妖精,fairy]哇啊啊！别说这么可怕的话啊！吓死人了！",
                                "\t[勇士,hero]现在我最想弄清楚的问题是，在听到女孩笑声直到我踏进密室的这段时间里，我没看到任何人出入。",
                                "\t[勇士,hero]可是现在，密室里只有你们两个人而已，这个行凶者难不成还会瞬移？",
                                "\t[妖精,fairy]哦，这个啊，我记得那家伙在对我们施完虐以后，就从房间北面的这个小木窗里逃跑了。",
                                {
                                    "type": "move",
                                    "loc": [
                                        2,
                                        1
                                    ],
                                    "time": 500,
                                    "keep": true,
                                    "steps": [
                                        "right:1"
                                    ]
                                },
                                {
                                    "type": "moveHero",
                                    "time": 500,
                                    "steps": [
                                        "up:2"
                                    ]
                                },
                                {
                                    "type": "animate",
                                    "name": "hand",
                                    "loc": [
                                        2,
                                        0
                                    ]
                                },
                                "\t[勇士,hero]（我敲打了一下木窗......有回音，这后面应该不是一堵墙。）",
                                {
                                    "type": "animate",
                                    "name": "sword",
                                    "loc": [
                                        2,
                                        0
                                    ]
                                },
                                "\t[勇士,hero]（我尝试用剑砍，用肘部敲击，甚至用身体去撞这个看上去不是很坚固的木窗，但是无论我怎样做，木窗都纹丝不动。）",
                                {
                                    "type": "changePos",
                                    "loc": [
                                        2,
                                        1
                                    ],
                                    "direction": "right"
                                },
                                "\t[勇士,hero]这个木窗似乎跟整个空间粘合在了一起，完全无法用外力破坏。",
                                "\t[勇士,hero]这个特性让我想起来魔塔里随处可见的黄蓝门，这扇木窗，据我猜测，应该是需要特定钥匙才能打开的魔法器。",
                                "\t[妖精,fairy]你接下来打算怎么办？",
                                "\t[勇士,hero]当然是找钥匙打开这扇木窗，找到她，然后好好清算一下这笔账。",
                                "\t[妖精,fairy]虽然我知道你是在为我跟杰克考虑，但是......别被仇恨冲昏头脑啊。",
                                "\t[勇士,hero]我可不仅仅是为了替你们两个报仇。",
                                "\t[勇士,hero]她对你跟杰克出手的原因，无非就是为了让我无法继续向顶层前进，既然她明我暗，与其坐以待毙，我还不如主动出击。",
                                "\t[杰克,thief]......慢着，你怎么知道她的目的是阻止你前进？",
                                "\t[勇士,hero]她囚禁妖精这个向导，是为了断绝我的信息来源，她废掉了你另一支手臂，则是让我无法借助你的力量挖通前往下一个区域的通道。",
                                "\t[勇士,hero]我甚至怀疑三区域宝库里的镐头也是被她给拿走的......这家伙，心机可真深，想来并不是什么容易对付的敌人。",
                                "\t[妖精,fairy]可是......就凭你一个人的力量，能跟这样的敌人对抗吗？",
                                "\t[妖精,fairy]让我陪你一起去吧......唔！好痛！",
                                "\t[勇士,hero]别逞强，你现在伤势重得连起身都难，就不要来陪我赶这趟浑水了。",
                                "\t[勇士,hero]对了，你不是会治愈魔法吗？我看你这些伤都在治愈魔法能够使用的范围内啊。",
                                "\t[妖精,fairy]使用魔法需要消耗巨额魔力，但在这一路的冒险中我的魔力槽早就见底了，抱歉，我好像不能陪你同行了......",
                                "\t[杰克,thief]我曾经挖密道来过地下层，我知道地下层二区有颗被众多魔物看守的精魂宝石，这种宝石拥有恢复使用者全额魔力的神奇力量。",
                                "\t[妖精,fairy]......嗯，没错，是有这种东西来着，我怎么忘记了呢？",
                                "\t[勇士,hero]好，我这就前往地下二区找那颗宝石，只能先委屈你们留在这里等我了。",
                                "\t[杰克,thief]对了，哥们儿，拿上这个。",
                                {
                                    "type": "setValue",
                                    "name": "item:I1515",
                                    "operator": "+=",
                                    "value": "1"
                                },
                                "从杰克手中接过了 [商店抵用券]*1",
                                "\t[妖精,fairy]那我也来给你提供一些规则范围内允许的帮助吧。",
                                {
                                    "type": "setValue",
                                    "name": "item:I1546",
                                    "operator": "+=",
                                    "value": "1"
                                },
                                "从妖精手中接过了 [便携式恢复药水]*1",
                                "\t[勇士,hero]多谢，就算只是为了不辜负你们对我的一番好意，我也一定会把这个万恶的行凶者给揪出来的。",
                                {
                                    "type": "setValue",
                                    "name": "flag:N9F",
                                    "value": "1"
                                }
                            ]
                        },
                        {
                            "case": "3",
                            "action": [
                                "\t[妖精,fairy]找到那颗宝石了吗？",
                                "\t[勇士,hero]让你久等了，接着。",
                                "\t[杰克,thief]......",
                                "\t[勇士,hero]（不知道为什么，杰克此时看上去有点慌张，额头上渗出的汗水不是因为疼痛，而是紧张。）",
                                "\t[妖精,fairy]嗯......乍一看只是一颗普通的回魔宝石而已。",
                                "\t[妖精,fairy]我记得这种宝石的用法跟魔塔里随处可见的攻防宝石一样，只要捏碎就能让储存在宝石内的魔力转移到使用者身上。",
                                "\t[妖精,fairy]......（那么......就让我来看看，这颗我无法观测到的宝石里，究竟储存着什么东西吧。）",
                                {
                                    "type": "animate",
                                    "name": "yongchang",
                                    "loc": [
                                        3,
                                        1
                                    ]
                                },
                                "\t[勇士,hero]（一道蓝色的光柱从宝石残骸中漫出，将妖精整个小小的身躯笼罩在其中。）",
                                "\t[妖精,fairy]魔力全额恢复了，看来这颗宝石里储存的都是一些最基础的灵魂能量而已。",
                                "\t[妖精,fairy]不过，不知道为什么......这颗宝石并不处于魔力饱和状态，就像一个只装了半瓶水的玻璃瓶，难道另一半内容物被什么人给吸收了吗？",
                                "\t[杰克,thief]......呼。",
                                "\t[勇士,hero]（蹲在角落里的杰克长舒一口气，他紧拧着的眉头终于舒缓开来，仿佛忘却了疼痛。）",
                                "\t[勇士,hero]怎么样妖精，魔力都恢复了吗？",
                                "\t[妖精,fairy]托你的福，现在的我可是精力充沛哦，说起来，你为了得到这颗宝石，一定独自一人历经了不少场艰难的战斗吧，真是辛苦你了。",
                                "\t[勇士,hero]（突然对我满嘴客套话的她，让我有些反感，同时心中也升起了另一缕疑惑。）",
                                "\t[勇士,hero]这些话先放一边吧，你先给自己跟杰克疗伤再说。",
                                "\t[妖精,fairy]真是冷淡啊......",
                                {
                                    "type": "animate",
                                    "name": "yongchang",
                                    "loc": [
                                        3,
                                        1
                                    ]
                                },
                                {
                                    "type": "animate",
                                    "name": "yongchang",
                                    "loc": [
                                        4,
                                        2
                                    ]
                                },
                                "\t[杰克,thief]......",
                                "\t[杰克,thief]......虽然我这条手臂已经恢复了功能，但是没有那把镐头的话，我仍然无法帮你开启通往下一个区域的通道。",
                                "\t[勇士,hero]现在可以确定的是，故意拿走那把镐头的人，只可能是那个对你们施虐的女孩，因为只有那家伙有干出这种事的动机。",
                                "\t[妖精,fairy]那现在我们该怎么办才好？",
                                "\t[勇士,hero]除了这扇木窗以外，也没有其他的去处了，正好我的战利品中有一把木制的特殊钥匙，说不定这把钥匙正好就能打开这扇木窗。",
                                "\t[杰克,thief]我跟你一起去。",
                                "\t[妖精,fairy]虽然知道进入那种地方可能会遇到危险......但我还是会选择陪你同行的。",
                                "\t[勇士,hero]妖精，杰克，多谢你们了。",
                                "\t[妖精,fairy]对了，说起来上个区域的福袋我还没有给你，接着。",
                                {
                                    "type": "switch",
                                    "condition": "flag:hard",
                                    "caseList": [
                                        {
                                            "case": "1",
                                            "action": [
                                                {
                                                    "type": "setValue",
                                                    "name": "item:I1574",
                                                    "operator": "+=",
                                                    "value": "1"
                                                }
                                            ]
                                        },
                                        {
                                            "case": "2",
                                            "action": [
                                                {
                                                    "type": "setValue",
                                                    "name": "item:I1575",
                                                    "operator": "+=",
                                                    "value": "1"
                                                }
                                            ]
                                        },
                                        {
                                            "case": "3",
                                            "action": [
                                                {
                                                    "type": "setValue",
                                                    "name": "item:I1576",
                                                    "operator": "+=",
                                                    "value": "1"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                "\t[勇士,hero]事不宜迟，趁那家伙还没逃远，现在就追过去吧。",
                                {
                                    "type": "hide",
                                    "loc": [
                                        [
                                            3,
                                            1
                                        ]
                                    ],
                                    "remove": true
                                },
                                {
                                    "type": "follow",
                                    "name": "yaojing.png"
                                },
                                {
                                    "type": "moveHero",
                                    "time": 500,
                                    "steps": [
                                        "up:3"
                                    ]
                                },
                                {
                                    "type": "setValue",
                                    "name": "item:I340",
                                    "operator": "-=",
                                    "value": "1"
                                },
                                {
                                    "type": "changeFloor",
                                    "floorId": "EXA9",
                                    "loc": [
                                        9,
                                        11
                                    ],
                                    "direction": "up",
                                    "time": 500
                                },
                                {
                                    "type": "moveHero",
                                    "time": 500,
                                    "steps": [
                                        "up:1"
                                    ]
                                },
                                "\t[勇士,hero]（走进暗房，一股刺鼻的腥味便扑面而来，这股味道跟下水道里腐败的死鱼内脏同级，常人根本就无法忍受。）",
                                "\t[勇士,hero]（这个小房间里陈列着各式各样的刑具，这些冰冷锐器上沾染的鲜血，表明曾有众多的受害者在暗房里遭受常人无法想象的虐待。）",
                                "\t[妖精,fairy]......好像没有其他人在的样子。",
                                "\t[勇士,hero]（妖精四处张望着，似乎是第一次来到这个地方。）",
                                "\t[勇士,hero]妖精，你不是说你从小在魔塔里长大，对每层的构造都了如指掌吗？",
                                "\t[妖精,fairy]啧......我以前从没听说过魔塔里还有这么可怕的地方，更不用说来过了。",
                                "\t[妖精,fairy]先别管这个了，我们可不是来闲逛的。",
                                "\t[勇士,hero]看来行凶者已经离开这里了。",
                                "\t[勇士,hero]木窗外头那边有你跟杰克看守着，她应该是用其他路线逃出这里的......先在这间暗房里搜查一下吧。",
                                {
                                    "type": "setValue",
                                    "name": "flag:N9F",
                                    "value": "null"
                                },
                                {
                                    "type": "hide",
                                    "loc": [
                                        [
                                            4,
                                            2
                                        ]
                                    ],
                                    "floorId": "MA9",
                                    "remove": true
                                },
                                {
                                    "type": "hide",
                                    "loc": [
                                        [
                                            3,
                                            1
                                        ]
                                    ],
                                    "floorId": "MA9",
                                    "remove": true
                                },
                                {
                                    "type": "hide",
                                    "loc": [
                                        [
                                            2,
                                            3
                                        ]
                                    ],
                                    "floorId": "MA9",
                                    "remove": true
                                }
                            ]
                        },
                        {
                            "case": "default",
                            "action": []
                        }
                    ]
                }
            ]
        }
    },
    "changeFloor": {
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "2,4": [
            {
                "type": "setBgFgBlock",
                "name": "fg",
                "number": "X10054",
                "loc": [
                    [
                        2,
                        0
                    ]
                ]
            },
            {
                "type": "hide",
                "loc": [
                    [
                        1,
                        1
                    ]
                ],
                "remove": true
            },
            {
                "type": "setBlock",
                "number": "fairy",
                "loc": [
                    [
                        2,
                        1
                    ]
                ]
            },
            {
                "type": "hide",
                "loc": [
                    [
                        3,
                        1
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        4,
                        1
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        1,
                        2
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        2,
                        2
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        3,
                        2
                    ]
                ],
                "remove": true
            },
            {
                "type": "setBlock",
                "number": "thief",
                "loc": [
                    [
                        4,
                        2
                    ]
                ]
            },
            {
                "type": "hide",
                "loc": [
                    [
                        1,
                        3
                    ]
                ],
                "remove": true
            },
            {
                "type": "setBlock",
                "number": "ground",
                "loc": [
                    [
                        2,
                        3
                    ]
                ]
            },
            {
                "type": "hide",
                "loc": [
                    [
                        3,
                        3
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        4,
                        3
                    ]
                ],
                "remove": true
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10016,10017,10017,10017,10017,10018,  2,  2,  2,  2,  2,  2,  2],
    [10024,10025,10025,10025,10025,10026, 88,  2,1276,  2,1262,1262,  2],
    [10024,10025,10025,10025,10025,10026,  0, 82,  0,897,1269,1283,  2],
    [10024,10025,10025,10025,10025,10026,525,  2,772,  2,  2, 81,  2],
    [10032,10033, 82,10033,10033,10034,1269, 81,  0,  2,1283,1262,  2],
    [  2,1262,  0, 81, 22,  2,1264,  2,  0,219, 21,1262,  2],
    [  2,  2,897,  2,  2,  2,  2, 22,525,  2, 82,  2,  2],
    [  2,1269,  0, 81,1290,897,1269,  2,  0,  0,836,1269,  2],
    [  2,1276,  0,  2,1515,  2, 21,1264,  2, 81,  2,  2,  2],
    [  2,  2,836,  2,  2,  2, 82,  2,  2,219,  2,1263,  2],
    [  2, 21,897,1263, 82,  0,  0,  0,219,  0, 81,1262,  2],
    [  2,1276,  2,1269,  2,1290, 87,1264,  2,1269,  2,1263,  2],
    [  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2]
],
    "underGround": true,
    "bgmap": [

],
    "fgmap": [

]
}