main.floors.MT0=
{
    "floorId": "MT0",
    "title": "主塔 0 层",
    "name": "主塔 0 层",
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "defaultGround": "ground",
    "images": [],
    "ratio": 1,
    "map": [
    [  2,  2,  2,  2,  2,  2,  1,  1,  1,  1,  1,  1,  1],
    [  2,  4,  4,  2,  0,  0,  0,  0,  0,  1,  5,  5,  1],
    [  2,  4,  4,  2,  0,  0,  0,  0,  0,  1,  5,  5,  1],
    [  2,  4,  4,  2,  0,  0,  0,  0,  0,  1,  5,  5,  1],
    [  2,  4,  4,  2,  0,  0,  0,  0,  0,  1,  5,  5,  1],
    [  2,  2,  2,  2,  0,  0,124,  0,  0,  1,  1,  1,  1],
    [  2, 88,  0, 85,  0,  0,  0,  0,  0, 85,  0, 87,  1],
    [  2,  2,  2,  2,  0,  0,  0,  0,  0,  1,  1,  1,  1],
    [  2,  4,  4,  2,  0,  0,  0,  0,  0,  1,  5,  5,  1],
    [  2,  4,  4,  2,  0,  0,  0,  0,  0,  1,  5,  5,  1],
    [  2,  4,  4,  2,  0,  0,  0,  0,  0,  1,  5,  5,  1],
    [  2,  4,  4,  2,  0,  0,  0,  0,  0,  1,  5,  5,  1],
    [  2,  2,  2,  2,  2,  2,  1,  1,  1,  1,  1,  1,  1]
],
    "firstArrive": [
        "\t[妖精,fairy]勇士，你终于醒了，感觉怎么样？",
        "\t[勇士,hero]你是什么人？",
        "\t[妖精,fairy]别摆出一副那么凶狠的脸来嘛。虽然我的确是魔物来的，但我啊可是善良可爱乐于助人的妖精族哦。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[勇士,hero]（从这家伙身上感觉不到任何敌意。）",
        "\t[勇士,hero]这里是什么地方？为什么我会昏倒在这里？",
        "\t[妖精,fairy]如你所见，这里就是你们人类拼尽全力想要攻打下来的通天高塔——魔塔。",
        "\t[勇士,hero]我从没听说过这样的地方。",
        "\t[勇士,hero]不对，我似乎忘记了很多重要的事情。",
        "\t[勇士,hero]（脑袋里就像钻进了无数只马蜂，乱糟糟的，甚至连自己的名字都想不起来。）",
        "\t[妖精,fairy]嗯？你刚才好像露出了十分困惑的表情，如果有什么困扰的话，跟我倾诉也没关系的。",
        "\t[勇士,hero]先回答我的第一个问题，你到底是什么人？",
        "\t[妖精,fairy]我是这座魔塔的守护精灵，负责为挑战者提供规则内允许的帮助跟提示。总而言之就是免费的导游，这样的存在。",
        "\t[勇士,hero]守护精灵？那你知道怎样才能离开这个鬼地方吗？",
        "\t[妖精,fairy]离开？你身为勇者，怎么能够说出这么没出息的话来？",
        "\t[妖精,fairy]公主大人可是还被关押在暗无天日的塔顶受尽折磨哦！",
        "\t[妖精,fairy]再说了，如果你就这样两手空空的跑回去，非但拿不到国王许诺的巨额赏金，甚至还有可能被杀头！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[勇士,hero]（我隐约记得自己来这里的目的，的确是为了救某个人来着，这家伙应该没有说谎。）",
        "\t[勇士,hero]勇者救公主的老套戏码吗，原来我还肩负着这样的使命。那么，我接下来应该怎么做才好？",
        "\t[妖精,fairy]不愧是勇者，进入角色的速度很快嘛！",
        "\t[妖精,fairy]从头说起，你之所以昏倒在这里，是因为不敌那些强大的魔物。",
        "\t[妖精,fairy]幸亏你碰见了熟悉治愈魔法的我才得以保住性命。不幸的是，你随身携带的手册跟剑盾都被那群魔物给抢走了。",
        "\t[勇士,hero]所以，我接下来的首要任务就是夺回那些属于我的东西，对吧。",
        "\t[妖精,fairy]啊！跟聪明人对话真是省事！顺带一提，你的铁剑在4楼，铁盾在6楼。尽早拿回这些装备会让你接下来的冒险顺利不少。",
        "\t[勇士,hero]多谢提醒。",
        {
            "type": "moveHero",
            "steps": [
                "right:2"
            ]
        },
        "\t[妖精,fairy]诶？你要去哪里？",
        "\t[勇士,hero]当然是去更高的楼层探索啊，有什么不妥吗？",
        "\t[妖精,fairy]哈啊，真是可怕的执行力啊。魔塔可不是什么说来就来说走就走的旅游胜地。",
        "\t[妖精,fairy]塔里居住着各式各样的魔物，其中不乏强者。而且这些魔物们在里头修筑了无数的迷宫与机关，贸然进入的话，是绝不会有好下场的。",
        "\t[勇士,hero]可是，空手回国的话就会被斩首。以我现在的处境也没有其他的路线可以选择了吧。",
        "\t[妖精,fairy]说的也是。",
        "\t[妖精,fairy]对了！让我陪你一起去吧！我从小就在魔塔里长大，对每层的构造了如指掌，有我陪你同行的话，存活率一定能增加不少！",
        "\t[勇士,hero]好吧。（这也是规则范围允许的帮助吗？）",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    5
                ]
            ],
            "remove": true
        },
        "妖精加入了队伍。",
        {
            "type": "openDoor",
            "loc": [
                9,
                6
            ]
        },
        {
            "type": "follow",
            "name": "yaojing.png"
        }
    ],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,6": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,6": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "bgmap": [

],
    "fgmap": [

],
    "width": 13,
    "height": 13,
    "autoEvent": {},
    "beforeBattle": {},
    "cannotMoveIn": {}
}