main.floors.MT11=
{
    "floorId": "MT11",
    "title": "主塔 11 层",
    "name": "主塔 11 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "bgm.mp3",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 300
        },
        "\t[勇士,hero]（这个区域的魔物明显比之前区域的强出一个档次。）",
        "\t[妖精,fairy]首先，欢迎来到第二区域。你是极少数可以突破到这里来的勇者，真是能干啊。",
        "\t[勇士,hero]你的意思是，在我之前还有其他人类在魔塔里探险过吗？",
        "\t[妖精,fairy]我在这座塔里生活了十几年之久，挑战者总数加起来起码能组成一支军队了。不久之前就有几个勇士来魔塔里送死呢。",
        "\t[妖精,fairy]只不过跟那些饭桶比起来，无论是对机制的理解。还是对大局的掌握能力都差远了。顺带一提，大多数勇士都死在了第一个区域。",
        "\t[勇士,hero]可这一路上，我没有看到任何人类的尸体，或者是那些曾经的勇士们留下来的痕迹。",
        "\t[妖精,fairy]我不是说过了吗，魔塔里存在着以尸体为食的凶残魔物。在它们手中战败的话，是不可能留下全尸的。",
        "\t[勇士,hero]就算尸体会被吃掉，脚印还是会留下来的吧？",
        "\t[妖精,fairy]为什么你总是会在这些奇怪的地方纠结半天啊。魔塔的辈分可比你爷爷还大，脚印或是他们战斗留下的痕迹，肯定早就被时光给抹灭了啊。",
        "\t[勇士,hero]没错，天花板跟地板上全是厚重的灰尘，跟一层叠一层的蛛网。看样子，的确很久都没有人来过这里了。",
        "\t[勇士,hero]不对劲。",
        "\t[勇士,hero]妖精，一个连窗户都没有的密闭空间，要怎样才会变成“地板跟天花板上全是厚重的灰尘”这种状态？",
        "\t[妖精,fairy]笨啊，这么简单的问题。太久没有生物在这个密闭空间里活动，时间长了当然就会发展成这个状态啊。",
        "\t[勇士,hero]可是魔塔里除了我们以外，是存在着其他生物的，而且数量众多。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[妖精,fairy]......",
        "\t[勇士,hero]这些生物，就是魔物，各式各样的魔物。既然这些魔物一直居住在魔塔里，它们便不可避免要捕食跟繁衍，这些本能，都会导致它们的“活动”。",
        "\t[勇士,hero]一个完全密闭的空间里，如果有数量众多的生物在进行“活动”，按理来说，灰尘跟蛛网都是不应该存在的东西。",
        "\t[妖精,fairy]你当勇士之前难道还是个侦探小说的作家吗？可是你忽略了最重要的一点——魔塔里的魔物们都是站在原地不动的，甚至都不能算作是“生物”。",
        "\t[勇士,hero]（的确是这样没错，那些魔物仿佛都被脚下的地板固定住了一样，就算我从它们面前走过，也不会遭受它们的袭击。）",
        "\t[勇士,hero]这个问题我一开始就想问，为什么它们不会移动？为什么它们不会主动攻击我？如果它们肯合作战斗的话，或许我早就是一具尸体了。",
        "\t[妖精,fairy]真烦人，哪来那么多为什么？用常识来揣测魔塔的存在本身就是一个错误。别想太多了，继续前进吧。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[勇士,hero]（不对劲，这一切都太不对劲了。我居然现在才意识到这一点......）",
        "\t[勇士,hero]嗯......我们走吧。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,1": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,12": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1, 87,  0,  0,277, 34,213,  0,  1, 27,  1, 28,  1],
    [  1,  1,  1, 81,  1, 82,  1,277,216, 21, 82, 21,  1],
    [  1, 22,  0, 34,213,  0,  0,  0,  1,277,  1, 34,  1],
    [  1,  0, 21,  1,  1,214,  1, 81,  1, 81,  1,234,  1],
    [  1,215,  1,  1,  1,  0,277,  0,  0,  0,  0,  0,  1],
    [  1, 32, 28, 32, 82,  0,  1, 30,  1,  1, 81,  1,  1],
    [  1,  1,  1,277,  1,213,  1,  1, 27,  1,  0, 31,  1],
    [  1,  0, 22,  0, 81,  0, 33, 81,  0,218,  0, 34,  1],
    [  1,216,  1,215,  1,277,  1,  1,213,  1,214,  1,  1],
    [  1, 33, 81, 27,  1,  0,  0,277,  0, 81, 32, 21,  1],
    [  1,233,  1, 27, 82,  0,  0,  1, 28,  1, 27, 32,  1],
    [  1,  1,  1,  1,  1,  1, 88,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

]
}