main.floors.MT16=
{
    "floorId": "MT16",
    "title": "主塔 16 层",
    "name": "主塔 16 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "bgm.mp3",
    "firstArrive": [],
    "eachArrive": [
        {
            "type": "if",
            "condition": "(flag:show16green===1)",
            "true": [
                {
                    "type": "setValue",
                    "name": "flag:show16green",
                    "value": "2"
                },
                "\t[勇士,hero]（空气中弥漫着一股刺鼻的血腥味。）",
                "\t[勇士,hero]（糟糕，看来我来晚一步，杰克莫非已经遭遇不测了？）"
            ]
        }
    ],
    "parallelDo": "",
    "events": {
        "11,2": [
            {
                "type": "switch",
                "condition": "flag:THIEF_16F",
                "caseList": [
                    {
                        "case": "0",
                        "action": [
                            "\t[勇士,hero]（一个看上去很憔悴的人类青年。）",
                            "\t[勇士,hero]（他的整个右臂都以一种超出人类理解范畴的姿态扭曲着，绑满了绷带。）",
                            "\t[勇士,hero]（他抬起头望了我一眼，灰暗的双眸突然泛起了些许神采。）",
                            "\t[杰克,thief]......是你。",
                            "\t[勇士,hero]（当他看到我身后的妖精时，就像虔诚的基督教徒看见了魔鬼般，笑容凝固在了脸上。）",
                            "\t[杰克,thief]......",
                            "\t[妖精,fairy]哟，这不是杰克大盗吗？你这次又惹上什么事了，被揍成这样，丢在这么个脏兮兮的小旮旯里，真是可怜啊。",
                            "\t[杰克,thief]偷东西被抓了现形而已，跟往常一样。你倒是越来越敬业了啊，这次居然直接跟他同路了。",
                            "\t[勇士,hero]你们认识？",
                            "\t[妖精,fairy]这座塔里有谁不知道他杰克大盗的威名，连高级卫兵看守着的神圣盾都敢去偷的大胆之徒，他能活到现在简直是个奇迹。",
                            "\t[杰克,thief]别取笑我了，妖精。我现在只想一个人好好静一静......你们走吧。",
                            {
                                "type": "sleep",
                                "time": 500,
                                "noSkip": true
                            },
                            "\t[勇士,hero]神圣盾是第五区域的装备对吧？我看你的样子不像是战斗能力特别强的角色，你是用什么手段突破到那么高的楼层的？",
                            {
                                "type": "sleep",
                                "time": 500,
                                "noSkip": true
                            },
                            "\t[勇士,hero]（不对，我明明什么都不记得了，为什么却能脱口而出“神圣盾是第五区域的装备”？）",
                            "\t[杰克,thief]这个啊，我对自己挖地道跟隐匿身形的本领还是很有自信的。",
                            "\t[妖精,fairy]可是你擅长使镐的右手已经彻底废了，现在的你只是个没有任何利用价值的废人而已。",
                            "\t[妖精,fairy]别在废人身上浪费时间了，我们继续前进吧，勇士。",
                            "\t[杰克,thief]你这话可真是过分，但我没办法反驳，一路小心，这个区域的魔物可不好惹。",
                            "\t[勇士,hero]妖精，你不是会一些治愈魔法吗？以你的力量，应该能让他的手臂恢复功能吧？",
                            "\t[妖精,fairy]不行，我的治愈魔法只能加快伤口的恢复速度，对于已经完全坏死的器官组织是没有效果的。",
                            "\t[勇士,hero]这样啊，真是遗憾。如果能治好他的手，让他挖出一条通往高层的密道的话，我们就能直接救出公主了。",
                            "\t[杰克,thief]想让我帮你挖密道吗？也不是不可以，帮我把我的镐头找回来。",
                            "\t[勇士,hero]哦？只要找回镐头就可以吗？",
                            "\t[杰克,thief]嘿嘿，单手挖密道这种事情我以前又不是没干过，只要你帮我找到镐头，我一定帮你挖密道。",
                            "\t[勇士,hero]好，这个忙我帮定了，到时候你可不要食言。",
                            "\t[勇士,hero]（他瞥了一眼我身后的妖精，似乎是在观察她的反应。）",
                            "\t[妖精,fairy]很好，好啊，不愧是杰克大盗，厉害厉害。",
                            "\t[勇士,hero]妖精，你对魔塔的构造了如指掌对吧，那你知道镐头的具体位置吗？",
                            "\t[妖精,fairy]如果我没记错的话应该在第三区域吧，不是现在的你可以考虑的事情。",
                            "\t[勇士,hero]抱歉，杰克，可能要让你再多等一会儿了。",
                            "\t[杰克,thief]没事的，再久我也会等，祝你们一路顺风。",
                            {
                                "type": "setValue",
                                "name": "flag:THIEF_16F",
                                "value": "1"
                            }
                        ]
                    },
                    {
                        "case": "1",
                        "action": [
                            "\t[杰克,thief]还没找到镐头吗？"
                        ]
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "1,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {
        "10,2": [
            "\t[勇士,hero]（一把沾满人血的绿钥匙，掉落在这种地方，多半是杰克身上的东西了。）",
            "\t[勇士,hero]（目前有绿门的地方......只有0层左侧有一扇，这是杰克故意留给我的线索吗？）"
        ]
    },
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1, 88, 22,  1, 27,  0, 82, 38,  1,  1, 23,  1,  1],
    [  1,  0,  0,255,  0, 21,  1,  0, 82, 33,  0,123,  1],
    [  1,  1, 82,  1,216,  1,  1,214,  1,  1,234,  1,  1],
    [  1, 34,  0,213,  0,213,  1,213,  1,  1, 81,  1,  1],
    [  1, 32,  0,  1,  1,  0,214,  0, 34,  0,  0, 30,  1],
    [  1,  1, 81,  1,  1,218,  1,  1,  1, 81,  1,  1,  1],
    [  1, 21, 28,218,  1,  0,213,213,  0,  0,  0, 34,  1],
    [  1,  1,  1, 34, 81,  0,  1,  1, 30,  1, 81,  1,  1],
    [  1, 22,  1,214,  1,255,  1, 32,  1, 28,215, 21,  1],
    [  1,  0, 81,  0, 82, 33,214, 32, 82, 29,  1, 21,  1],
    [  1, 87,  1,  1,  1, 27,  1, 27,  1, 33,  1, 22,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

]
}