main.floors.MT21=
{
    "floorId": "MT21",
    "title": "主塔 21 层",
    "name": "主塔 21 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "bgm.mp3",
    "firstArrive": [
        "\t[勇士,hero]......",
        "\t[妖精,fairy]怎么了？突然愣在原地不动。快点快点，赶紧继续往前走啊。",
        "\t[勇士,hero]这一路上，我弄不懂的谜团越来越多。比起舍弃理智盲目前进，我更想好好思考一下我现在的处境。",
        "\t[妖精,fairy]哈啊？......好好好，一个个都麻烦的不行。随你，我倒想看看你能思考出个什么所以然来。",
        "\t[勇士,hero]首先，我现在最想弄明白的问题是，我究竟是谁？",
        "\t[妖精,fairy]在0层初次见面的时候不是都跟你说过了吗......你是个普通的勇者，来到魔塔的目的是拯救被囚禁在塔顶的公主，就是这样。",
        "\t[勇士,hero]......还有呢？你还知道其他关于我身份的信息吗？",
        "\t[妖精,fairy]没了，你的人设就这么一句话而已，普普通通的平凡勇者。哦，现在是磨磨叽叽普普通通的平凡勇者",
        "\t[勇士,hero]......我的名字是什么。",
        "\t[妖精,fairy]莫名其妙......如果你像家犬一样，脖子上面系着个写着名字的狗牌，我或许能回答你这个问题。",
        "\t[勇士,hero]......（她的态度好像越来越不耐烦了，看来我得换个问题。）",
        "\t[勇士,hero]妖精，你知道我要拯救的公主是个怎样的人吗？",
        "\t[妖精,fairy]我只知道她是你们人类王国视为掌上明珠的公主，我不知道她的样子跟名字，毕竟她一直都被囚禁在这座塔的顶层。",
        "\t[勇士,hero]囚禁她的人是谁？",
        "\t[妖精,fairy]是这座魔塔的主人，人们通常叫他魔王。我知道你接下来要问什么，虽然我从小在魔塔里长大，但我从没见过魔王长什么样，叫什么名字。",
        "\t[妖精,fairy]好了，你还有什么想问我的？没有就继续赶路，走走走。",
        "\t[勇士,hero]我对于我要救的女人跟我要面对的敌人一无所知......我甚至连自己是谁都不知道。",
        "\t[勇士,hero]这根本就是一场彻头彻尾的闹剧。我不认为我在掌握如此贫瘠的信息量的情况下能够完成任务，所以我选择回国。",
        "\t[妖精,fairy]回国？你疯了吗？你明知道空手回去的话会被斩首的！",
        "\t[勇士,hero]至少我能得到一个明明白白的死法。我要是继续以这种状态在魔塔里探索，我可能连自己最后是怎么死的都不知道。",
        "\t[妖精,fairy]喂喂！你不是吧？这就自暴自弃了？想清楚，你要是离开魔塔了，公主就要一辈子被关在顶层遭受虐待了哦！",
        "\t[勇士,hero]我救她的动机无非就是“我空手回国就要被斩首”，既然我放弃了这个莫名其妙的任务，那么她的死活便与我毫不相干。",
        "\t[妖精,fairy]......你有没有同情心啊！你忍心眼睁睁看着一个弱女子毁在那些魔物手里吗？勇士，能够拯救她的人只有你啊！",
        "\t[勇士,hero]你刚才说过我只是个没有任何特点的勇者没错吧？",
        "\t[勇士,hero]你之前也提到过，攻打魔塔的勇者数量多到可以组支军队，仔细想想也是，公主的安危对于一个国家来说可是一件不容小觑的大事。",
        "\t[勇士,hero]王国没理由会只派出我一个“普普通通”的勇者来执行一个如此重要的任务，就算我失败了，还会有能力更强的勇者来顶替我的位置。",
        "\t[勇士,hero]我说的没错吧，妖精？",
        "\t[妖精,fairy]......啧，你到底想说什么？",
        "\t[勇士,hero]你这一路上不停催促我向顶层进发，是不是有什么......别的目的？",
        "\t[妖精,fairy]哈啊？你怀疑我在欺骗你吗？你倒是说说我骗你能对我有什么好处？",
        "\t[勇士,hero]别激动，我没有怀疑你，完全没有。我只是觉得，你在试图对我隐瞒一些事情。",
        "\t[妖精,fairy]......哈啊？不可理喻，我这样做的目的是什么？害死你？要是你死在半路上，没有战斗力的我寸步难行，最后将会被数量众多的魔物分食。",
        "\t[妖精,fairy]再者，要是没有我这一路上的陪同，你早就没命了！事到如今你居然还怀疑我？",
        {
            "type": "sleep",
            "time": 500,
            "noSkip": true
        },
        "\t[勇士,hero]......抱歉，妖精。",
        "\t[妖精,fairy]道歉倒是蛮快的......哼，以后不许再怀疑我了！下次你再敢这样，我就不理你了！哼！",
        "\t[勇士,hero]......（闹起小脾气来了，看来她完全就是一个任性的小女孩嘛......这样的家伙能有什么心机？）",
        "\t[勇士,hero]......（看来这一切都是我多虑了，不过，还是觉得有什么地方不对劲。）",
        "\t[妖精,fairy]好了好了，别发愣了，再耽误时间公主尸体都要凉了，继续前进！",
        "\t[勇士,hero]嗯......"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "10,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,1269,  1,1276,  1,  1, 87,  1,1262,1262,  1,  1,  1],
    [  1,  0,224,  0,226,226,  0,  1,  0,  0, 81,1269,  1],
    [  1,  1, 82,  1, 81,  1,232,  1,226,  1,  1,  1,  1],
    [  1, 21, 21,226,  0,  0,  0, 81,  0,  0, 82,1263,  1],
    [  1,  1,225,  1,  1, 81,  1,  1,  1,226,  1,1276,  1],
    [  1,1290,1276,1269,  1,1264,  1,1269,  1,1283,  1,  1,  1],
    [  1,  1, 81,  1,  1,  1,  1,1261, 81,1261, 81,1269,  1],
    [  1, 21,  0,253,226,  0,226,  0,  1,226,  1,1262,  1],
    [  1,  1,236,  1,  1, 81,  1, 81,  1, 81,  1,227,  1],
    [  1,  0,1283,  0, 82,1262,253, 21,227,  0,  0,  0,  1],
    [  1,1269,  0,1276,  1, 22,  1, 21,  1,  0, 88,  1,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

]
}