main.floors.MT4=
{
    "floorId": "MT4",
    "title": "主塔 4 层",
    "name": "主塔 4 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "bgm.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "2,1": [
            {
                "type": "if",
                "condition": "(flag:Shop4===0)",
                "true": [
                    "\t[勇士,hero]一座奇怪的神像，隐隐有诡异的红光在眼睛跟嘴的位置闪烁着。",
                    "\t[勇士,hero]等等，这座神像的下端，似乎有个形状整齐的孔洞。",
                    "\t[妖精,fairy]观察的很仔细嘛，你来猜猜看这座神像的用途是什么？",
                    "\t[勇士,hero]这个矩形孔洞刚好比那堆从怪物的尸体里搜刮出的金币大一小圈，这东西的作用......嗯......自动贩卖机？",
                    "\t[妖精,fairy]跟以前那些见到神像二话不说就开砸的野蛮勇者比起来，你的悟性可以说是很好了。",
                    "\t[妖精,fairy]没错，这种神像是贪婪之神的神龛，直接联结着贪婪之神的神识，只要往里头供奉足够多的金币，就能得到神的祝福。",
                    "\t[勇士,hero]神的祝福是什么？先说好，我可不信任何神，能形容的通俗笼统一些吗？",
                    "\t[妖精,fairy]你试试不就知道了？来，往里头塞几个金币实践一下。",
                    {
                        "type": "setValue",
                        "name": "flag:Shop4",
                        "value": "1"
                    },
                    "全局商店已开启，按V可开启快捷商店。"
                ],
                "false": []
            },
            {
                "type": "openShop",
                "id": "shop4",
                "open": true
            }
        ]
    },
    "changeFloor": {
        "1,6": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,  7,131,  8,  1,203, 81, 34,  1,206, 31, 31,  1],
    [  1, 21, 46, 22,206,  0,  1,  1,206, 31,  1,206,  1],
    [  1,  1, 82,  1,  1,  0,  0,204,  0,  1,  1,206,  1],
    [  1, 32,  0,  1, 27,  1,206,  1,  0, 82, 35, 32,  1],
    [  1,  0,  0, 81, 31,210,  0,  1,206,  1,  1,  1,  1],
    [  1, 88,  0,  1, 28,  1,  0, 81,  0,203, 27, 32,  1],
    [  1,  1,  1,  1,  1,  1,209,  1,206,  1,  1, 81,  1],
    [  1, 21, 29,206, 32,203,  0,  0,  0,211, 28, 32,  1],
    [  1,  1, 82,  1, 81,  1,217,  1, 82,  1, 81,  1,  1],
    [  1, 21,  0,207, 22,  1, 32, 81, 21,207,  0,  0,  1],
    [  1,  0, 27,  1, 22,  1, 22,  1, 34,  1, 22, 87,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

]
}