main.floors.MT41=
{
    "floorId": "MT41",
    "title": "主塔 41 层",
    "name": "主塔 41 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "images": [],
    "ratio": 3,
    "defaultGround": "ground",
    "bgm": "bgm.mp3",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500,
            "noSkip": true
        },
        "\t[勇士,hero]（这些魔物，曾是我灵魂的一部分。）",
        "\t[勇士,hero]（这座魔塔，是囚禁我灵魂的意识监牢。）",
        "\t[勇士,hero]（眼前的景象逐渐开始模糊起来。）",
        "\t[勇士,hero]（这是意识空间开始崩坏的表现。）",
        "\t[勇士,hero]（由于知悉了残酷真相的我内心发生了动摇，此时我眼中那些无比平常的景象，也变得触目惊心起来。）",
        "\t[勇士,hero]（这是一颗卒子与生俱来的宿命，从始至终我都没有别的路可以走，除了一路向前，我早已没有其他选择。）",
        "\t[勇士,hero]（没时间感慨了，出发吧。）"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,10": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,5": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,  1,1592,  1,1270,1270,  1,  1, 22,  1,1277,1270,  1],
    [  1, 21,1369,1173, 21,1369,606,642, 22,642, 21,1369,  1],
    [  1,1369,1277,  1, 82,  1, 81,  1, 81,  1, 82,  1,  1],
    [  1, 81,  1,  1,  0,266, 22,266,  0,  0,1368,  0,  1],
    [  1, 87,208, 82,  0,  1,  1,  1,  1,606,  1,513,  1],
    [  1,  1,  1,  1,  0,266,1369,  1,1277,  0, 82,1284,  1],
    [  1, 56,  1,1369,208,  1, 81,  1,1270,  0,  1,1368,  1],
    [  1,1631,  1,642,  1,  1, 81,  1,  1, 81,  1,  1,  1],
    [  1, 21,266,  0,266,1367,  0,1367,  1,1173,  1,1277,  1],
    [  1,  1, 82,  1,  1,  0, 88,  0, 82,  0,  0,606,  1],
    [  1,1367,1270,1368,  1,1367,  0,1367,  1, 21, 22,  1,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

]
}