main.floors.MT7=
{
    "floorId": "MT7",
    "title": "主塔 7 层",
    "name": "主塔 7 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "bgm.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "9,5": [
            "\t[勇士,hero]（一个衣衫褴褛的人类老人。）",
            "\t[勇士,hero]（眼睛跟嘴被生锈的钢丝铰得严丝合缝。）",
            "\t[勇士,hero]（老人似乎无法发声，只得手舞足蹈摆出各种动作，似乎想向我传达某些讯息。）",
            "\t[勇士,hero]抱歉，我完全看不懂你想表达什么。",
            "\t[勇士,hero]（老人脸上立即显现出痛苦跟颓唐的神情来。）",
            "\t[勇士,hero]抱歉了老人家，如果有纸笔的话，或许我就能理解你的想法了。",
            {
                "type": "jump",
                "time": 500,
                "keep": true
            },
            "\t[勇士,hero]（老人指着天花板，有点跛的脚不停踏着地板。）",
            "\t[勇士,hero]（完全不理解他想表达什么。）",
            "\t[勇士,hero]（老人的表情越发痛苦，他冲上前来用力扯住我的袖子，拼命摇晃着。）",
            {
                "type": "move",
                "time": 500,
                "keep": true,
                "steps": [
                    "left:1"
                ]
            },
            {
                "type": "playSound",
                "name": "attack.mp3"
            },
            "\t[勇士,hero]（不好，下意识的推了一下，但愿没有伤到他。）",
            "\t[勇士,hero]（老人摇了摇头，拖着残破的身体缓缓消失在了我们的视线中。）",
            {
                "type": "hide",
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        8,
                        5
                    ]
                ],
                "remove": true,
                "time": 500
            },
            "\t[勇士,hero]妖精，你知道刚才那个奇怪老人的来历吗？",
            "\t[妖精,fairy]从我记事起就一直在魔塔里徘徊，不知从哪来的疯老头罢了，别管他，任这家伙在魔塔里自生自灭吧。",
            "\t[勇士,hero]（不知道为什么，总觉得那位老人家有点面熟，是我的错觉吗？）"
        ]
    },
    "changeFloor": {
        "11,5": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,  0,212, 32,207,  0, 87,  1, 21,  0, 34,  1,  1],
    [  1,217,  1, 81,  1,  1,  1,  1,  1, 82,  1, 30,  1],
    [  1,  0,221,  0,  0,210,  0,  1, 32,  0,212, 28,  1],
    [  1, 81,  1,  1,207,  1,210,211,210,  1,  1,  1,  1],
    [  1, 30,  1, 31, 22, 81,  0,  1,  0,121,  0, 88,  1],
    [  1,  1,  1,  1,  1,  1,204,  1,  1,  1,  1,  1,  1],
    [  1,  0, 21,  1, 29,  1,  0,211,  0, 82, 27,  1,  1],
    [  1,207,  1, 27,  0, 81,  0,  1,  0,  1,  0, 21,  1],
    [  1,  0,  0,  1,204,  1,  0,211,  0, 81,221,  1,  1],
    [  1,  1,212, 81,  0,206,207,  1,207,  1,  0, 28,  1],
    [  1, 22, 30,  1, 27,  1, 34,  1, 34,  1, 30,  1,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

]
}